#!/bin/bash
echo "==================================================="
echo "جاري تشغيل منظومة المبيعات..."
echo "==================================================="

if ! command -v node &> /dev/null
then
    echo "[خطأ]: برنامج Node.js غير مثبت على جهازك!"
    echo "يرجى تحميله وتثبيته من: https://nodejs.org/"
    exit
fi

if [ ! -d "node_modules" ]; then
    echo "[إعداد لأول مرة]: جاري تثبيت ملفات التشغيل الأساسية..."
    npm install
fi

echo "[نجاح]: جاري تشغيل الخادم المحلي للمنظومة..."
echo "سيتم فتح المتصفح تلقائيا الآن."
echo "(يرجى عدم إغلاق هذه النافذة طوال فترة استخدام المنظومة)"
echo "==================================================="

npm run dev -- --open
